# Interpolation

This is a technique where we fill any value if that are missing in its sequence means age column there 20,21,22,_,24,_,26,27

here missing two value so through interpolation we can fill the estimate value on the base of rest data in column

In [ ]:
import pandas as pd;

In [7]:
data={
    "name":["shahid","basit","king","kumail","askari","siraj","shukoor","kazim","muhammad","sakina","khatija","kubra"],
    "age":[23,24,25,20,None,23,46,78,64,30,26,28],
    "salary":[3873,9472,None,2890,4232,3211,2222,4562,1234,3421,1235,7632],
    "performance Score":[85,23,45,None,14,45,67,78,90,33,66,88],

}
df=pd.DataFrame(data)
df

        name   age  salary  performance Score
0     shahid  23.0  3873.0               85.0
1      basit  24.0  9472.0               23.0
2       king  25.0     NaN               45.0
3     kumail  20.0  2890.0                NaN
4     askari   NaN  4232.0               14.0
5      siraj  23.0  3211.0               45.0
6    shukoor  46.0  2222.0               67.0
7      kazim  78.0  4562.0               78.0
8   muhammad  64.0  1234.0               90.0
9     sakina  30.0  3421.0               33.0
10   khatija  26.0  1235.0               66.0
11     kubra  28.0  7632.0               88.0

### Now Interpolation method

In [5]:
df.interpolate(method="linear",axis=0,inplace=True)
df

C:\Users\aaa\AppData\Local\Temp\ipykernel_20272\4024095860.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate(method="linear",axis=0,inplace=True)

        name   age  salary  performance Score
0     shahid  23.0  3873.0               85.0
1      basit  24.0  9472.0               23.0
2       king  25.0  6181.0               45.0
3     kumail  20.0  2890.0               29.5
4     askari  21.5  4232.0               14.0
5      siraj  23.0  3211.0               45.0
6    shukoor  46.0  2222.0               67.0
7      kazim  78.0  4562.0               78.0
8   muhammad  64.0  1234.0               90.0
9     sakina  30.0  3421.0               33.0
10   khatija  26.0  1235.0               66.0
11     kubra  28.0  7632.0               88.0